//Strings for delete confirmation dialog

//Title
"Are you sure you want to delete the selected recipient(s)?" = "Haluatko varmasti poistaa valitut vastaanottajat?";

//Buttons
"Delete" = "Poista";
"Cancel" = "Peruuta";